docs/mesh_allocator.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-Jan-27 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Understanding Mesh Allocator</title>
<meta name="author" content="Veera Sivarajan" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./css/style.css"/>
</head>
<body>
<header id="top" class="status">
<nav>
  <a href="https://github.com/veera-sivarajan">GitHub</a>
  <a href="/">Home</a>
  <a href="/about/">About</a>
  <a href="mailto:sveera.2001@gmail.com">Email</a>
</nav>  
</header>
<main id="content" class="content">
<header>
<h1 class="title">Understanding Mesh Allocator</h1>
<p class="subtitle" role="doc-subtitle">2024-Jan-24</p>
</header><p>
I recently read about the <a href="https://github.com/plasma-umass/Mesh">Mesh memory allocator</a> and was fascinated by its ability to perform compaction without changing the addresses of allocated objects.
</p>

<p>
In this post, I will briefly summarize how Mesh allocator works. For more details about its algorithms and implementation, refer to the <a href="https://raw.githubusercontent.com/plasma-umass/Mesh/master/mesh-pldi19-powers.pdf">paper (PDF)</a> by Bobby Powers et al. or watch this <a href="https://www.youtube.com/watch?v=xb0mVfnvkp0">talk</a>.
</p>
<section id="outline-container-org690370e" class="outline-2">
<h2 id="org690370e"><span class="section-number-2">1.</span> Fragmentation</h2>
<div class="outline-text-2" id="text-1">
<p>
Applications written in manually memory managed languages might fail to allocate memory, even when the required amount of space is available in memory. This problem is known as memory <a href="https://en.wikipedia.org/wiki/Fragmentation_(computing)">fragmentation</a> and can be solved by compaction, where all allocated objects are moved together to make a contiguous block of free space available.
</p>

<p>
Garbage collected languages can solve this by stopping program execution to compact allocated objects and update all pointers to point to the relocated objects. But, languages which expose raw pointers to the programmer don&rsquo;t have this luxury as it is impossible to trace and update all the pointers.
</p>

<p>
Therefore, to reduce memory fragmentation for applications written in manually memory managed languages, compaction should occur without changing the pointers&rsquo; values and this is exactly where Mesh shines.
</p>
</div>
</section>
<section id="outline-container-orgdb1b52b" class="outline-2">
<h2 id="orgdb1b52b"><span class="section-number-2">2.</span> Compaction Without Relocation</h2>
<div class="outline-text-2" id="text-2">
<p>
The Mesh allocator performs compaction without relocation by taking advantage of the fact that pointers are virtual memory addresses pointing to objects on physical memory. This allows the allocator to move objects in the physical memory and update the virtual to physical memory mapping without changing the virtual memory address of allocated objects.
</p>

<p>
There are three core concepts behind the Mesh allocator:
</p>
</div>
<div id="outline-container-org2b745cf" class="outline-3">
<h3 id="org2b745cf"><span class="section-number-3">2.1.</span> Meshing</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Meshing is the phase where objects are relocated in physical memory. It randomly selects physical memory pages with objects allocated at non-overlapping offsets and merges (meshes) them together by copying all objects from one page to another. The copied objects retain their original offsets. Then, the page from which content was moved is given back to the operating system; effectively reducing memory consumption.
</p>

<p>
This does not affect performance as meshing is performed concurrently without stopping program execution.
</p>
</div>
</div>
<div id="outline-container-org6074843" class="outline-3">
<h3 id="org6074843"><span class="section-number-3">2.2.</span> Updating Virtual to Physical Address Mapping</h3>
<div class="outline-text-3" id="text-2-2">
<p>
After meshing, the process&rsquo;s page table is updated to remap the virtual memory addresses of moved objects to the new physical addresses. However, the program is unaware of this change because the virtual memory addresses (pointers) remain the same since the offsets of objects have not changed.
</p>
</div>
</div>
<div id="outline-container-org5327b16" class="outline-3">
<h3 id="org5327b16"><span class="section-number-3">2.3.</span> Randomized Allocation</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Memory allocation is randomly spread throughout a page to facilitate meshing by increasing the chances of pages having objects allocated at non-overlapping offsets. This doesn&rsquo;t <a href="https://news.ycombinator.com/item?id=19182779#19185084">seem</a> to affect cache performance as allocations returned from popular memory allocators are not contiguous either.
</p>
</div>
</div>
</section>
<section id="outline-container-org351fed0" class="outline-2">
<h2 id="org351fed0"><span class="section-number-2">3.</span> Conclusion</h2>
<div class="outline-text-2" id="text-3">
<p>
This memory allocator has proven to significantly reduce the memory consumption of Firefox and Redis with only a small increase in performance overhead.
</p>

<p>
I&rsquo;m amazed at how simple and easy-to-understand techniques can significantly reduce fragmentation while maintaining performance, without requiring any changes to the codebase.
</p>
</div>
</section>
</main>
<footer id="postamble" class="status">
<script id="umaring_js" src="https://umaring.hamy.cc/ring.js?id=veera"></script>
<div id="umaring"></div>
<div class='footer'>
  Last updated on 2024-Jan-27 Sat 11:21. <br>
</div>
</footer>
</body>
</html>
